docs/evidence/02-outbox-pattern/problem/k6-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /tmp/test-evidence/order-load.js
        output: Prometheus remote write (http://34.64.219.137:30090/api/v1/write)

     scenarios: (100.00%) 1 scenario, 5 max VUs, 1m30s max duration (incl. graceful stop):
              * constant_load: 5 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 5/5 VUs, 2 complete and 0 interrupted iterations
constant_load   [   2% ] 5 VUs  0m01.0s/1m0s

running (0m02.0s), 5/5 VUs, 7 complete and 0 interrupted iterations
constant_load   [   3% ] 5 VUs  0m02.0s/1m0s

running (0m03.0s), 5/5 VUs, 12 complete and 0 interrupted iterations
constant_load   [   5% ] 5 VUs  0m03.0s/1m0s

running (0m04.0s), 5/5 VUs, 16 complete and 0 interrupted iterations
constant_load   [   7% ] 5 VUs  0m04.0s/1m0s

running (0m05.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
constant_load   [   8% ] 5 VUs  0m05.0s/1m0s

running (0m06.0s), 5/5 VUs, 25 complete and 0 interrupted iterations
constant_load   [  10% ] 5 VUs  0m06.0s/1m0s

running (0m07.0s), 5/5 VUs, 30 complete and 0 interrupted iterations
constant_load   [  12% ] 5 VUs  0m07.0s/1m0s

running (0m08.0s), 5/5 VUs, 34 complete and 0 interrupted iterations
constant_load   [  13% ] 5 VUs  0m08.0s/1m0s

running (0m09.0s), 5/5 VUs, 40 complete and 0 interrupted iterations
constant_load   [  15% ] 5 VUs  0m09.0s/1m0s

running (0m10.0s), 5/5 VUs, 45 complete and 0 interrupted iterations
constant_load   [  17% ] 5 VUs  0m10.0s/1m0s

running (0m11.0s), 5/5 VUs, 49 complete and 0 interrupted iterations
constant_load   [  18% ] 5 VUs  0m11.0s/1m0s

running (0m12.0s), 5/5 VUs, 53 complete and 0 interrupted iterations
constant_load   [  20% ] 5 VUs  0m12.0s/1m0s

running (0m13.0s), 5/5 VUs, 58 complete and 0 interrupted iterations
constant_load   [  22% ] 5 VUs  0m13.0s/1m0s

running (0m14.0s), 5/5 VUs, 63 complete and 0 interrupted iterations
constant_load   [  23% ] 5 VUs  0m14.0s/1m0s

running (0m15.0s), 5/5 VUs, 68 complete and 0 interrupted iterations
constant_load   [  25% ] 5 VUs  0m15.0s/1m0s

running (0m16.0s), 5/5 VUs, 74 complete and 0 interrupted iterations
constant_load   [  27% ] 5 VUs  0m16.0s/1m0s

running (0m17.0s), 5/5 VUs, 80 complete and 0 interrupted iterations
constant_load   [  28% ] 5 VUs  0m17.0s/1m0s

running (0m18.0s), 5/5 VUs, 85 complete and 0 interrupted iterations
constant_load   [  30% ] 5 VUs  0m18.0s/1m0s

running (0m19.0s), 5/5 VUs, 90 complete and 0 interrupted iterations
constant_load   [  32% ] 5 VUs  0m19.0s/1m0s

running (0m20.0s), 5/5 VUs, 94 complete and 0 interrupted iterations
constant_load   [  33% ] 5 VUs  0m20.0s/1m0s

running (0m21.0s), 5/5 VUs, 100 complete and 0 interrupted iterations
constant_load   [  35% ] 5 VUs  0m21.0s/1m0s

running (0m22.0s), 5/5 VUs, 105 complete and 0 interrupted iterations
constant_load   [  37% ] 5 VUs  0m22.0s/1m0s

running (0m23.0s), 5/5 VUs, 111 complete and 0 interrupted iterations
constant_load   [  38% ] 5 VUs  0m23.0s/1m0s

running (0m24.0s), 5/5 VUs, 116 complete and 0 interrupted iterations
constant_load   [  40% ] 5 VUs  0m24.0s/1m0s

running (0m25.0s), 5/5 VUs, 123 complete and 0 interrupted iterations
constant_load   [  42% ] 5 VUs  0m25.0s/1m0s

running (0m26.0s), 5/5 VUs, 129 complete and 0 interrupted iterations
constant_load   [  43% ] 5 VUs  0m26.0s/1m0s

running (0m27.0s), 5/5 VUs, 136 complete and 0 interrupted iterations
constant_load   [  45% ] 5 VUs  0m27.0s/1m0s

running (0m28.0s), 5/5 VUs, 143 complete and 0 interrupted iterations
constant_load   [  47% ] 5 VUs  0m28.0s/1m0s

running (0m29.0s), 5/5 VUs, 151 complete and 0 interrupted iterations
constant_load   [  48% ] 5 VUs  0m29.0s/1m0s

running (0m30.0s), 5/5 VUs, 159 complete and 0 interrupted iterations
constant_load   [  50% ] 5 VUs  0m30.0s/1m0s

running (0m31.0s), 5/5 VUs, 165 complete and 0 interrupted iterations
constant_load   [  52% ] 5 VUs  0m31.0s/1m0s

running (0m32.0s), 5/5 VUs, 172 complete and 0 interrupted iterations
constant_load   [  53% ] 5 VUs  0m32.0s/1m0s

running (0m33.0s), 5/5 VUs, 175 complete and 0 interrupted iterations
constant_load   [  55% ] 5 VUs  0m33.0s/1m0s

running (0m34.0s), 5/5 VUs, 180 complete and 0 interrupted iterations
constant_load   [  57% ] 5 VUs  0m34.0s/1m0s

running (0m35.0s), 5/5 VUs, 185 complete and 0 interrupted iterations
constant_load   [  58% ] 5 VUs  0m35.0s/1m0s

running (0m36.0s), 5/5 VUs, 193 complete and 0 interrupted iterations
constant_load   [  60% ] 5 VUs  0m36.0s/1m0s

running (0m37.0s), 5/5 VUs, 202 complete and 0 interrupted iterations
constant_load   [  62% ] 5 VUs  0m37.0s/1m0s

running (0m38.0s), 5/5 VUs, 211 complete and 0 interrupted iterations
constant_load   [  63% ] 5 VUs  0m38.0s/1m0s

running (0m39.0s), 5/5 VUs, 218 complete and 0 interrupted iterations
constant_load   [  65% ] 5 VUs  0m39.0s/1m0s

running (0m40.0s), 5/5 VUs, 226 complete and 0 interrupted iterations
constant_load   [  67% ] 5 VUs  0m40.0s/1m0s

running (0m41.0s), 5/5 VUs, 233 complete and 0 interrupted iterations
constant_load   [  68% ] 5 VUs  0m41.0s/1m0s

running (0m42.0s), 5/5 VUs, 241 complete and 0 interrupted iterations
constant_load   [  70% ] 5 VUs  0m42.0s/1m0s

running (0m43.0s), 5/5 VUs, 248 complete and 0 interrupted iterations
constant_load   [  72% ] 5 VUs  0m43.0s/1m0s

running (0m44.0s), 5/5 VUs, 255 complete and 0 interrupted iterations
constant_load   [  73% ] 5 VUs  0m44.0s/1m0s

running (0m45.0s), 5/5 VUs, 262 complete and 0 interrupted iterations
constant_load   [  75% ] 5 VUs  0m45.0s/1m0s

running (0m46.0s), 5/5 VUs, 270 complete and 0 interrupted iterations
constant_load   [  77% ] 5 VUs  0m46.0s/1m0s

running (0m47.0s), 5/5 VUs, 277 complete and 0 interrupted iterations
constant_load   [  78% ] 5 VUs  0m47.0s/1m0s

running (0m48.0s), 5/5 VUs, 284 complete and 0 interrupted iterations
constant_load   [  80% ] 5 VUs  0m48.0s/1m0s

running (0m49.0s), 5/5 VUs, 290 complete and 0 interrupted iterations
constant_load   [  82% ] 5 VUs  0m49.0s/1m0s

running (0m50.0s), 5/5 VUs, 299 complete and 0 interrupted iterations
constant_load   [  83% ] 5 VUs  0m50.0s/1m0s

running (0m51.0s), 5/5 VUs, 306 complete and 0 interrupted iterations
constant_load   [  85% ] 5 VUs  0m51.0s/1m0s

running (0m52.0s), 5/5 VUs, 314 complete and 0 interrupted iterations
constant_load   [  87% ] 5 VUs  0m52.0s/1m0s

running (0m53.0s), 5/5 VUs, 323 complete and 0 interrupted iterations
constant_load   [  88% ] 5 VUs  0m53.0s/1m0s

running (0m54.0s), 5/5 VUs, 329 complete and 0 interrupted iterations
constant_load   [  90% ] 5 VUs  0m54.0s/1m0s

running (0m55.0s), 5/5 VUs, 339 complete and 0 interrupted iterations
constant_load   [  92% ] 5 VUs  0m55.0s/1m0s

running (0m56.0s), 5/5 VUs, 346 complete and 0 interrupted iterations
constant_load   [  93% ] 5 VUs  0m56.0s/1m0s

running (0m57.0s), 5/5 VUs, 355 complete and 0 interrupted iterations
constant_load   [  95% ] 5 VUs  0m57.0s/1m0s

running (0m58.0s), 5/5 VUs, 364 complete and 0 interrupted iterations
constant_load   [  97% ] 5 VUs  0m58.0s/1m0s

running (0m59.0s), 5/5 VUs, 371 complete and 0 interrupted iterations
constant_load   [  98% ] 5 VUs  0m59.0s/1m0s

running (1m00.0s), 5/5 VUs, 381 complete and 0 interrupted iterations
constant_load   [ 100% ] 5 VUs  1m00.0s/1m0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<5000' p(95)=612.65ms

    http_req_failed
    ✓ 'rate<0.5' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 386     6.371664/s
    checks_succeeded...: 100.00% 386 out of 386
    checks_failed......: 0.00%   0 out of 386

    ✓ created or error

    HTTP
    http_req_duration..............: avg=280.82ms min=49.59ms  med=212.23ms max=1.24s p(90)=561.62ms p(95)=612.65ms
      { expected_response:true }...: avg=280.82ms min=49.59ms  med=212.23ms max=1.24s p(90)=561.62ms p(95)=612.65ms
    http_req_failed................: 0.00%  0 out of 386
    http_reqs......................: 386    6.371664/s

    EXECUTION
    iteration_duration.............: avg=782.46ms min=550.25ms med=713.23ms max=1.74s p(90)=1.06s    p(95)=1.12s   
    iterations.....................: 386    6.371664/s
    vus............................: 5      min=5        max=5
    vus_max........................: 5      min=5        max=5

    NETWORK
    data_received..................: 295 kB 4.9 kB/s
    data_sent......................: 157 kB 2.6 kB/s



running (1m00.6s), 0/5 VUs, 386 complete and 0 interrupted iterations
constant_load ✓ [ 100% ] 5 VUs  1m0s